content/question_bank.org
#+Title: Question bank
#+Author: Tyler Burns
#+Date: May 25, 2024 - May 31, 2024

[[./index.html][Home]]

-----
/You're only as good as your last question./

My uncle Nigel, professor at the University of Michigan Ross School of Business. Said to me once in conversation years ago when I was neck deep in my graduate training.
-----

#+TOC: headlines 2

The following are questions, or groups of questions, that I have found helpful over the years. Especially for the questions related to personal agency, meaning, and motivation, you often have to let them simmer for a few days...or decades. I still revisit a lot of these questions. They speak differently in different contexts. Another way to word this: a lot of these are questions you "sit with" for a long time rather than answer as if they were essay questions for a college application. Sometimes, the answers materialize as words. Sometimes, they are feelings. Either way, take it all in.

I have organized the list below by specific people and specific questions associated with them. The questions that are between line separators are theirs. Questions that are mine are explicitly stated to be so. Commentary after the question is assumed to be my own unless otherwise stated.

* Pre-made collections of questions

** [[https://civilizationemerging.com/dharma-inquiry/][Daniel Schmachtenberger's Dharma Inquiry]]
#+HTML: <a href="#top">Back to top</a>
Absolutely brilliant set of questions around the concept of Dharma, which as Daniel defines it:

/Dharma, the way I hold it, roughly means: the path of right action; the path of greatest integrity; the path (of choices) that don’t create suffering and optimally helps heal it; the path that leads towards increasing wholeness, consciousness, health, and quality of life for all./

Here are the questions associated with this, quoted directly from the website linked above (none of these are mine). Super important is the repeating asking of "why."
-----
Capacities
- If my financial needs were already met for the rest of my life, what would I do?
- If I had the wealth of Bill Gates or Warren Buffet, what would I do with my life and resources?
- If I was going to go back to school, what would I study?
- If I could download skills matrix style, what would the top few most desired be?
- If I was a lot more confident/ less fearful, what would I do and how would I be differently?
- If I was meaningfully smarter than I currently am?
- If I had much better discipline?
- If I was better with people (more understanding, charismatic, empathetic, patient, etc.)?
- If I had better emotional regulation?
- If my main character deficits were resolved?
- If I had the right team and people supporting me?
- If my life started over with a clean slate (no previous commitments, baggage, etc.)?

Then ask “why” to your answers to each of these questions, until coming to something that feels fundamental.

Values
- Who are you most inspired by (that you personally know or figures from history)? What about them inspires you?
- Who do you respect the most? What about them?
- What virtues would you most want to increase in yourself? Why those ones?
- What types of behavior and people bother you the most?
- What issues in the world upset you the most?
- What do you see as most deeply wrong with or off in the world?
- What do you find the most beauty in? What are you most moved by?
- Who would you be the most proud to have been looking back at your life?
- What news stories about the world would you be most positively moved to see?
- What would you spend your time working on if you could succeed but no one would ever know that you did it?
- What few qualities would you most want to increase in everyone if you could?
- What would you sacrifice personal benefit for?
- What is more important to you than your own life?
- What is sacred to you? What does sacred mean?
- What are you devoted to? What does devotion mean?
- What is the basis of meaningfulness?
- What are you loyal to? What does loyalty mean? What would be an adequate reason to violate a loyalty?
- What do you feel shame or guilt about?
- If all your personal desires were already met, what would you then desire or care about?

Then ask “why” to your answers to each of these questions, until coming to something that feels fundamental.

Propensities
- What am I naturally good at? What seems to come easy to me? (Looking at strengths and aptitudes more than specific skills.)
- What types of activities do I feel replenished by?
- What am I willing to do even if it taxes me?
- What do I enjoy doing for its own sake, independent of producing results or getting acknowledgement?
- What is my attention repeatedly called to? What can I not not pay attention to?
- What am I intrinsically fascinated by? Passionate about?
- Where have I felt the most pride/satisfaction related to something I did?
- When have I felt most fully alive?
- What have been the greatest difficulties/pains in my life?
-----

And of course, we also have to include the questions that are associated with the antipode to Dharma, which are below:

-----
- Where am I being reactive rather than creative?
- Where are my goals the result of compensations to old wounds? (Proving that I’m enough, proving something to parents or a parental archetype projected on the world, seeking validation externally, proving we aren’t like our parents, etc.)
- Where am I still running the programs of my childhood (early models of success, of who I am, of what I’m capable of, of what’s meaningful…)
- What of the things I did last month will I remember and feel good about on my deathbed? Which will I wish I had done differently? How do I factor that into planning my next month?
- Where is fear influencing my choices?
- Where are there incongruences in my self, between my values and my actions…between some desires and other desires…between my habits and the expression of my highest vision…?
- Where is my sense of limited capacity constraining what I focus on?
- Where am I acting out of reaction, habit, or unconsciousness?
- Where do I feel trapped by past choices (loyalties, commitments, debts, investments, etc.)?
- Where are lack of self worth or self trust keeping me from showing up in greater service to what I care about?
- Where is credit seeking or image management influencing how I’m choosing?
- What do I do that I wouldn’t want to be fully honest about?
- What parts of my life would not engender the respect of those whom I respect the most?
- Where is my success occurring at the expense of others?
- Where does my life feel imbalanced?
- What do I do because I’m good at it but don’t really like it or care about it deeply?
-----

