public/question_bank.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Question bank</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="simple.css" />
</head>
<body>
<div id="preamble" class="status">
<div style="position: fixed; top: 10px; right: 10px;">
         <button class="toggle-theme-btn" onclick="toggleDarkMode()">Light/Dark</button>
       </div>
</div>
<div id="content" class="content">
<h1 class="title">Question bank</h1>
<p>
<a href="./index.html">Home</a>
</p>

<hr />
<p>
<i>You're only as good as your last question.</i>
</p>

<p>
My uncle Nigel, professor at the University of Michigan Ross School of Business. Said to me once in conversation years ago when I was neck deep in my graduate training.
</p>
<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org41b5200">Pre-made collections of questions</a>
<ul>
<li><a href="#org8998562">Daniel Schmachtenberger's Dharma Inquiry</a></li>
<li><a href="#orgdb236e7">Tim Ferriss 4 hour workweek</a></li>
<li><a href="#org58f544a">Tim Ferriss tribe of mentors</a></li>
</ul>
</li>
<li><a href="#orgd9e1e0d">Lists of questions in different domains</a>
<ul>
<li><a href="#org6e8ae3f">Biology</a></li>
<li><a href="#org149011b">Neuroscience</a></li>
<li><a href="#org07747b4">Physics</a></li>
<li><a href="#orge8da4c5">Math</a></li>
<li><a href="#org54c178b">Computing</a></li>
</ul>
</li>
<li><a href="#orgd9d15d7">Other</a></li>
</ul>
</div>
</div>

<p>
The following are questions, or groups of questions, that I have found helpful over the years. Especially for the questions related to personal agency, meaning, and motivation, you often have to let them simmer for a few days&#x2026;or decades. I still revisit a lot of these questions. They speak differently in different contexts. Another way to word this: a lot of these are questions you "sit with" for a long time rather than answer as if they were essay questions for a college application. Sometimes, the answers materialize as words. Sometimes, they are feelings. Either way, take it all in.
</p>

<p>
I have organized the list below by specific people and specific questions associated with them. The questions that are between line separators are theirs. Questions that are mine are explicitly stated to be so. Commentary after the question is assumed to be my own unless otherwise stated.
</p>

<div id="outline-container-org41b5200" class="outline-2">
<h2 id="org41b5200">Pre-made collections of questions</h2>
<div class="outline-text-2" id="text-org41b5200">
</div>
<div id="outline-container-org8998562" class="outline-3">
<h3 id="org8998562"><a href="https://civilizationemerging.com/dharma-inquiry/">Daniel Schmachtenberger's Dharma Inquiry</a></h3>
<div class="outline-text-3" id="text-org8998562">
<a href="#top">Back to top</a>
<p>
Absolutely brilliant set of questions around the concept of Dharma, which as Daniel defines it:
</p>

<p>
<i>Dharma, the way I hold it, roughly means: the path of right action; the path of greatest integrity; the path (of choices) that don’t create suffering and optimally helps heal it; the path that leads towards increasing wholeness, consciousness, health, and quality of life for all.</i>
</p>

<p>
Here are the questions associated with this, quoted directly from the website linked above (none of these are mine). Super important is the repeating asking of "why."
</p>
<hr />
<p>
Capacities
</p>
<ul class="org-ul">
<li>If my financial needs were already met for the rest of my life, what would I do?</li>
<li>If I had the wealth of Bill Gates or Warren Buffet, what would I do with my life and resources?</li>
<li>If I was going to go back to school, what would I study?</li>
<li>If I could download skills matrix style, what would the top few most desired be?</li>
<li>If I was a lot more confident/ less fearful, what would I do and how would I be differently?</li>
<li>If I was meaningfully smarter than I currently am?</li>
<li>If I had much better discipline?</li>
<li>If I was better with people (more understanding, charismatic, empathetic, patient, etc.)?</li>
<li>If I had better emotional regulation?</li>
<li>If my main character deficits were resolved?</li>
<li>If I had the right team and people supporting me?</li>
<li>If my life started over with a clean slate (no previous commitments, baggage, etc.)?</li>
</ul>

<p>
Then ask “why” to your answers to each of these questions, until coming to something that feels fundamental.
</p>

<p>
Values
</p>
<ul class="org-ul">
<li>Who are you most inspired by (that you personally know or figures from history)? What about them inspires you?</li>
<li>Who do you respect the most? What about them?</li>
<li>What virtues would you most want to increase in yourself? Why those ones?</li>
<li>What types of behavior and people bother you the most?</li>
<li>What issues in the world upset you the most?</li>
<li>What do you see as most deeply wrong with or off in the world?</li>
<li>What do you find the most beauty in? What are you most moved by?</li>
<li>Who would you be the most proud to have been looking back at your life?</li>
<li>What news stories about the world would you be most positively moved to see?</li>
<li>What would you spend your time working on if you could succeed but no one would ever know that you did it?</li>
<li>What few qualities would you most want to increase in everyone if you could?</li>
<li>What would you sacrifice personal benefit for?</li>
<li>What is more important to you than your own life?</li>
<li>What is sacred to you? What does sacred mean?</li>
<li>What are you devoted to? What does devotion mean?</li>
<li>What is the basis of meaningfulness?</li>
<li>What are you loyal to? What does loyalty mean? What would be an adequate reason to violate a loyalty?</li>
<li>What do you feel shame or guilt about?</li>
<li>If all your personal desires were already met, what would you then desire or care about?</li>
</ul>

<p>
Then ask “why” to your answers to each of these questions, until coming to something that feels fundamental.
</p>

<p>
Propensities
</p>
<ul class="org-ul">
<li>What am I naturally good at? What seems to come easy to me? (Looking at strengths and aptitudes more than specific skills.)</li>
<li>What types of activities do I feel replenished by?</li>
<li>What am I willing to do even if it taxes me?</li>
<li>What do I enjoy doing for its own sake, independent of producing results or getting acknowledgement?</li>
<li>What is my attention repeatedly called to? What can I not not pay attention to?</li>
<li>What am I intrinsically fascinated by? Passionate about?</li>
<li>Where have I felt the most pride/satisfaction related to something I did?</li>
<li>When have I felt most fully alive?</li>
<li>What have been the greatest difficulties/pains in my life?</li>
</ul>
<hr />

<p>
And of course, we also have to include the questions that are associated with the antipode to Dharma, which are below:
</p>

<hr />
<ul class="org-ul">
<li>Where am I being reactive rather than creative?</li>
<li>Where are my goals the result of compensations to old wounds? (Proving that I’m enough, proving something to parents or a parental archetype projected on the world, seeking validation externally, proving we aren’t like our parents, etc.)</li>
<li>Where am I still running the programs of my childhood (early models of success, of who I am, of what I’m capable of, of what’s meaningful…)</li>
<li>What of the things I did last month will I remember and feel good about on my deathbed? Which will I wish I had done differently? How do I factor that into planning my next month?</li>
<li>Where is fear influencing my choices?</li>
<li>Where are there incongruences in my self, between my values and my actions…between some desires and other desires…between my habits and the expression of my highest vision…?</li>
<li>Where is my sense of limited capacity constraining what I focus on?</li>
<li>Where am I acting out of reaction, habit, or unconsciousness?</li>
<li>Where do I feel trapped by past choices (loyalties, commitments, debts, investments, etc.)?</li>
<li>Where are lack of self worth or self trust keeping me from showing up in greater service to what I care about?</li>
<li>Where is credit seeking or image management influencing how I’m choosing?</li>
<li>What do I do that I wouldn’t want to be fully honest about?</li>
<li>What parts of my life would not engender the respect of those whom I respect the most?</li>
<li>Where is my success occurring at the expense of others?</li>
<li>Where does my life feel imbalanced?</li>
<li>What do I do because I’m good at it but don’t really like it or care about it deeply?</li>
</ul>
<hr />
</div>
</div>
