content/question_bank.org
** [[https://tim.blog/wp-content/uploads/2020/01/17-Questions-That-Changed-My-Life.pdf][Tim Ferriss 4 hour workweek]]
#+HTML: <a href="#top">Back to top</a>
As Tim puts it here, it's about "testing the impossible." I remember the sheer optimism I felt after reading 4HWW for the first time. The world rapidly changing, but without all the existential dread that we have now. Anyway, the questions are still important. Perhaps even moreso to win in a society that is increasingly pessimistic.

- What if I did the opposite for 48 hours?
- What do I spend a silly amount of money on? How might I scratch my own itch? Tim's example is that he was spending money on supplements, and so he created a supplement company.
- What would I do/have/be if I had $10 million? What's my real target montly income?
- What are the worst things that could happen? Could I get back here?
- If I could only work 2 hours a week on the business, what would I do? This is a "80/20 principle" prompter
- What if I let them make decisions up to $100? $500? $1000?
- What is the least crowded channel?
- What if I couldn't pitch my product directly?
- What if I craeted my own real-world MBA?
- Do I need to make it back the way I lost it?
- What if I could only subtract to solve problems?
- What might I put in place to allow me to go off the grid for 4 to 8 weeks, with no phone or email?
- Am I hunting antelope or field mice? This is in terms of whether I'm going after something big or something trivially small?
- Could it be that everything is fine and complete as is? This question is relevant especially in a culture that hacks things like FOMO to get us to buy stuff we don't need with money we don't have.
- What would this look like if it were easy? I ask myself this a lot.
- How can I throw money at the problem? How can I "waste" money to improve the quality of my life?
- No hurry, no pause (more of a statement than a question but still included here). I can say that being independent (eg. not working for someone) puts me in this state more often than not. It's a marathon, not a sprint, as my uncle likes to say.

** [[https://www.curatedquestions.com/tim-ferriss-tribe-of-mentors][Tim Ferriss tribe of mentors]]
#+HTML: <a href="#top">Back to top</a>
These are more interview questions than self-questions. But you can see that they are also good questions to ask yourself.

- What is the book (or books) that you have given most as a gift, and why? Or what are one to three books that have greatly influenced your life?
- What purchase of $100 or less has most positively impacted your life in the last six months (or in recent memory)?
- How has failure, or apparent failures, set you up for later success? Do you have a "favorite failure" of yours?
- If you could have a gigantic bilboard anywhere with anything on it - metaphorically speaking, getting a message out to millions or billions - what would it say and why? It could be a few words or a paragraph.
- What is one of the best and most important investments you have ever made? Could be time, time, energy, etc.
- What is an unusual habit or absurd thing that you love?
- In the past five years, what new belief, behavior, or habit has most improved your life?
- What advice would you give to a smart, driven college student about to enter the real world? What advice should they ignore?
- What are bad recommendations you hear in your profession or area of expertise?
- In the past five years, what have you become better at saying no to (distractions, invitations, etc)? What new realizations and/or approaches have helped? Any other tips?
- When you feel overwhelmed or unfocused, or have lost your focus temporarily, what do you do? What questions do you ask yourself?

* Lists of questions in different domains
#+HTML: <a href="#top">Back to top</a>
The links are to Wikipedia lists of unsolved problems for the given domain. Way too many questions to copy over and list here, so I'll list the ones that are on my mind from each section. My commentary is indicated, and my questions relevant to the given topic are listed below a line separator.

** [[https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_biology][Biology]]
- Exactly how, where and when did life on Earth originate? How does life arise from the nonliving?
- Exactly how and when did viruses originate?
- Why does biological ageing occur? Is it inevitable?
-----
- Does life exist on other planets (our anywhere outside of Earth)? These could be anything from microbes to intelligent life. Are the dark spots on Venus microbes? Is non-carbon based life possible (eg. on Titan)? Are there places to find life that we are blatently missing due to our built-in assumptions (eg. life arising from cellular automata-like computation deep inside a gas giant). These questions are not on the list.
- Did life start on Earth or did it come from elsewhere, as per the [[https://en.wikipedia.org/wiki/Panspermia][panspermia hypothesis]]. Elsewhere could be as simple as starting on Venus or Mars and being carried over to Earth.
- What did the so-called primordial soup look like? What exactly does proto-life look like? What are the intermediate steps between chemical reactions in the open versus being contain in a cell, versus being contained in a self replicating cell?
- When did viruses emerge? Do viruses (or self-replicating RNA) pre-date life?
- Can life develop and exist outside of so-called habitable zones?
** [[https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_neuroscience][Neuroscience]]
- What is free will? Is it an illusion? Is there a part of the brain that gives us a sense of free will? (related to but not on the list).
- How can consciousness be defined? What is its function? Can it exist after death?
-----
- Is the activity of the brain computable? In other words, could we build a computer that emulated a whole brain, neuron by neuron?
- To what extent do quantum effects matter for cognition? There has been research on this, but I've also heard the argument that invoking quantum is a way to mysticy human cognition and make it more "special" than it actually is.
