public/question_bank.html

<div id="outline-container-orgdb236e7" class="outline-3">
<h3 id="orgdb236e7"><a href="https://tim.blog/wp-content/uploads/2020/01/17-Questions-That-Changed-My-Life.pdf">Tim Ferriss 4 hour workweek</a></h3>
<div class="outline-text-3" id="text-orgdb236e7">
<a href="#top">Back to top</a>
<p>
As Tim puts it here, it's about "testing the impossible." I remember the sheer optimism I felt after reading 4HWW for the first time. The world rapidly changing, but without all the existential dread that we have now. Anyway, the questions are still important. Perhaps even moreso to win in a society that is increasingly pessimistic.
</p>

<ul class="org-ul">
<li>What if I did the opposite for 48 hours?</li>
<li>What do I spend a silly amount of money on? How might I scratch my own itch? Tim's example is that he was spending money on supplements, and so he created a supplement company.</li>
<li>What would I do/have/be if I had $10 million? What's my real target montly income?</li>
<li>What are the worst things that could happen? Could I get back here?</li>
<li>If I could only work 2 hours a week on the business, what would I do? This is a "80/20 principle" prompter</li>
<li>What if I let them make decisions up to $100? $500? $1000?</li>
<li>What is the least crowded channel?</li>
<li>What if I couldn't pitch my product directly?</li>
<li>What if I craeted my own real-world MBA?</li>
<li>Do I need to make it back the way I lost it?</li>
<li>What if I could only subtract to solve problems?</li>
<li>What might I put in place to allow me to go off the grid for 4 to 8 weeks, with no phone or email?</li>
<li>Am I hunting antelope or field mice? This is in terms of whether I'm going after something big or something trivially small?</li>
<li>Could it be that everything is fine and complete as is? This question is relevant especially in a culture that hacks things like FOMO to get us to buy stuff we don't need with money we don't have.</li>
<li>What would this look like if it were easy? I ask myself this a lot.</li>
<li>How can I throw money at the problem? How can I "waste" money to improve the quality of my life?</li>
<li>No hurry, no pause (more of a statement than a question but still included here). I can say that being independent (eg. not working for someone) puts me in this state more often than not. It's a marathon, not a sprint, as my uncle likes to say.</li>
</ul>
</div>
</div>

<div id="outline-container-org58f544a" class="outline-3">
<h3 id="org58f544a"><a href="https://www.curatedquestions.com/tim-ferriss-tribe-of-mentors">Tim Ferriss tribe of mentors</a></h3>
<div class="outline-text-3" id="text-org58f544a">
<a href="#top">Back to top</a>
<p>
These are more interview questions than self-questions. But you can see that they are also good questions to ask yourself.
</p>

<ul class="org-ul">
<li>What is the book (or books) that you have given most as a gift, and why? Or what are one to three books that have greatly influenced your life?</li>
<li>What purchase of $100 or less has most positively impacted your life in the last six months (or in recent memory)?</li>
<li>How has failure, or apparent failures, set you up for later success? Do you have a "favorite failure" of yours?</li>
<li>If you could have a gigantic bilboard anywhere with anything on it - metaphorically speaking, getting a message out to millions or billions - what would it say and why? It could be a few words or a paragraph.</li>
<li>What is one of the best and most important investments you have ever made? Could be time, time, energy, etc.</li>
<li>What is an unusual habit or absurd thing that you love?</li>
<li>In the past five years, what new belief, behavior, or habit has most improved your life?</li>
<li>What advice would you give to a smart, driven college student about to enter the real world? What advice should they ignore?</li>
<li>What are bad recommendations you hear in your profession or area of expertise?</li>
<li>In the past five years, what have you become better at saying no to (distractions, invitations, etc)? What new realizations and/or approaches have helped? Any other tips?</li>
<li>When you feel overwhelmed or unfocused, or have lost your focus temporarily, what do you do? What questions do you ask yourself?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd9e1e0d" class="outline-2">
<h2 id="orgd9e1e0d">Lists of questions in different domains</h2>
<div class="outline-text-2" id="text-orgd9e1e0d">
<a href="#top">Back to top</a>
<p>
The links are to Wikipedia lists of unsolved problems for the given domain. Way too many questions to copy over and list here, so I'll list the ones that are on my mind from each section. My commentary is indeicated, and my questions relevant to the given topic are listed below a line separator.
</p>
</div>

<div id="outline-container-org6e8ae3f" class="outline-3">
<h3 id="org6e8ae3f"><a href="https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_biology">Biology</a></h3>
<div class="outline-text-3" id="text-org6e8ae3f">
<ul class="org-ul">
<li>Exactly how, where and when did life on Earth originate? How does life arise from the nonliving?</li>
<li>Exactly how and when did viruses originate?</li>
<li>Why does biological ageing occur? Is it inevitable?</li>
</ul>
<hr />
<ul class="org-ul">
<li>Does life exist on other planets (our anywhere outside of Earth)? These could be anything from microbes to intelligent life. Are the dark spots on Venus microbes? Is non-carbon based life possible (eg. on Titan)? Are there places to find life that we are blatently missing due to our built-in assumptions (eg. life arising from cellular automata-like computation deep inside a gas giant). These questions are not on the list.</li>
<li>Did life start on Earth or did it come from elsewhere, as per the <a href="https://en.wikipedia.org/wiki/Panspermia">panspermia hypothesis</a>. Elsewhere could be as simple as starting on Venus or Mars and being carried over to Earth.</li>
<li>What did the so-called primordial soup look like? What exactly does proto-life look like? What are the intermediate steps between chemical reactions in the open versus being contain in a cell, versus being contained in a self replicating cell?</li>
<li>When did viruses emerge? Do viruses (or self-replicating RNA) pre-date life?</li>
<li>Can life develop and exist outside of so-called habitable zones?</li>
</ul>
</div>
</div>
<div id="outline-container-org149011b" class="outline-3">
<h3 id="org149011b"><a href="https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_neuroscience">Neuroscience</a></h3>
<div class="outline-text-3" id="text-org149011b">
<ul class="org-ul">
<li>What is free will? Is it an illusion? Is there a part of the brain that gives us a sense of free will? (related to but not on the list).</li>
<li>How can consciousness be defined? What is its function? Can it exist after death?</li>
</ul>
<hr />
<ul class="org-ul">
<li>Is the activity of the brain computable? In other words, could we build a computer that emulated a whole brain, neuron by neuron?</li>
<li>To what extent do quantum effects matter for cognition? There has been research on this, but I've also heard the argument that invoking quantum is a way to mysticy human cognition and make it more "special" than it actually is.</li>
</ul>
</div>
</div>
