content/question_bank.org
** [[https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_physics][Physics]]
- The diameter of the observable universe is about 93 billion light-years, but what is the size of the whole universe? Is the universe infinite?
- Why does time have a direction?
- The values of the fundamental physical constants are in a narrow range necessary to support carbon-based life. Is this because there are an infinite number of other universes with different constants (many worlds interpretation of quantum mechanics), or are our universe's constants the result of chance, or some other factor or process?
------
- Can the surface of a black hole perform the computation necessary to produce/simulate a universe? Where in the physical universe is complex computation happening (eg. very large scale cellular automata) that we otherwise might not appreciate right now?
- Is the universe infinite? If this is the case, then if we look far enough forward we will see the back of our heads. Related: does the universe have curvature?
- Is faster-than-light travel, or teleportation, or anything that gets us past the universe's speed limit possible? So much of science fiction relies on this.
- Is the many worlds interpretation of quantum mechanics true? How can we test this? Would there be way to interact with parallel universes? Another common [[https://en.wikipedia.org/wiki/Everything_Everywhere_All_at_Once][science fiction trope]].
** [[https://en.wikipedia.org/wiki/List_of_unsolved_problems_in_mathematics][Math]]
- What is the Turing completeness status of all unique elementary cellular automata?
-----
- Is there a way we can find out whether a cellular automata is Turing complete without literally building a Turing machine? Are there shortcuts? Is this something AI could help us with? How do we score cellular automata in terms of their complexity? Perhaps there is a spectrum that is more complete than the binary Turing complete or not Turing complete?
** Computing
- Can we develop human level or superhuman intelligence by means of scaling alone? If we keep feeding training examples into a LLM (or something multi-modal) and the architecture was a transformer with minimal bells and whistles, could we get to AGI? This is related to the [[https://gwern.net/scaling-hypothesis][scaling hypotheis]].
- Is it possible to align AGI with humanity? There are many who think the answer is no, and either AI will kill us directly, or AI intersecting with profit motives and our inner demons will kill us.

